## SOrt Column Values in Order

In [1]:
import pandas as pd 
import janitor
from numpy import nan

In [2]:
df = pd.DataFrame([{'SalesMonth': 'Jan', 'Company2': 180.0, 'Company3': 400.0},
 {'SalesMonth': 'Feb', 'Company2': 250.0, 'Company3': 500.0},
 {'SalesMonth': 'Feb', 'Company2': 250.0, 'Company3': 500.0},
 {'SalesMonth': 'Mar', 'Company2': nan, 'Company3': 600.0},
 {'SalesMonth': 'April', 'Company2': 500.0, 'Company3': 675.0}]
)

df

  SalesMonth  Company2  Company3
0        Jan     180.0     400.0
1        Feb     250.0     500.0
2        Feb     250.0     500.0
3        Mar       NaN     600.0
4      April     500.0     675.0

Given the current DataFrame, we want to order the sales month in desc order. To achieve this we would assign the later months with smaller values with the latest month, such as April with the precedence of 0.

In [3]:
df.sort_column_value_order(
    'SalesMonth',
    {'April':1,'Mar':2,'Feb':3,'Jan':4}
    )

  SalesMonth  Company2  Company3
4      April     500.0     675.0
3        Mar       NaN     600.0
1        Feb     250.0     500.0
2        Feb     250.0     500.0
0        Jan     180.0     400.0